<?php

namespace App\Common;

/**
 * api 状态码
 * Class ApiStatus
 */
class ApiStatus {

    const CODE_0 = '0';         // 成功
    //-+----------------------------------------------------------------------
    // | 接口协议级别 请求 错误
    //-+----------------------------------------------------------------------
    const CODE_1001 = '1001';//缺少参数

    const CODE_1002 = '1002';//方法错误

    const CODE_1011 = '1011';//操作失败

    const CODE_1021 = '1021';//资源不存在
    //-+----------------------------------------------------------------------
    // | 业务参数错误
    // | 用户部分
    //-+----------------------------------------------------------------------
    //用户部分
    const CODE_2001 = '2001';//登录失败
    //用户授权部分
    const CODE_2002 = '2002';//授权失败

    //-+----------------------------------------------------------------------
    // | 业务参数错误
    // | **部分
    //-+----------------------------------------------------------------------

    public static $errCodes = [
        self::CODE_0    => 'success',
        self::CODE_1001 => 'params required',
        self::CODE_1002 => 'method wrong',
        self::CODE_1011 => 'operation failed',
        self::CODE_1021 => 'resource not existed',

        self::CODE_2001 => 'login failed',
        self::CODE_2002 => 'Unauthorized'
    ];
}
